package Locale::CLDR::Ps;
# This file auto generated from Data\common\main\ps.xml
#	on Mon 31 Mar  1:40:01 am GMT
# XML file generated 2014-03-03 17:35:05 -0600 (Mon, 03 Mar 2014)

use v5.18;
use mro 'c3';
use utf8;

use Moose;

extends('Locale::CLDR::Root');
has 'display_name_language' => (
	is			=> 'ro',
	isa			=> 'CodeRef',
	init_arg	=> undef,
	default		=> sub { 
		 sub {
			 my %languages = (
				'af' => 'افريکاني',
 				'am' => 'امهاري',
 				'ar' => 'عربي',
 				'as' => 'اسمائى ژبه',
 				'az' => 'أذربائجاني',
 				'bal' => 'بلوڅي',
 				'be' => 'بېلاروسي',
 				'bg' => 'بلغاري',
 				'bn' => 'بنګالي',
 				'br' => 'برېتون',
 				'bs' => 'بوسني',
 				'ca' => 'کټلاني',
 				'cs' => 'چېک',
 				'cy' => 'ويلشي',
 				'da' => 'ډېنش',
 				'de' => 'الماني',
 				'el' => 'یوناني',
 				'en' => 'انګلیسي',
 				'eo' => 'اسپرانتو',
 				'es' => 'هسپانوي',
 				'et' => 'حبشي',
 				'eu' => 'باسکي',
 				'fa' => 'فارسي',
 				'fi' => 'فینلنډي',
 				'fil' => 'تګالوګ',
 				'fo' => 'فاروئې',
 				'fr' => 'فرانسوي',
 				'fy' => 'فريزي',
 				'ga' => 'ائيرلېنډي',
 				'gd' => 'سکاټلېنډي ګېلک',
 				'gl' => 'ګلېشيايي',
 				'gn' => 'ګوراني',
 				'gu' => 'ګجراتي',
 				'he' => 'عبري',
 				'hi' => 'هندي',
 				'hr' => 'کروواتي',
 				'hu' => 'هنګري',
 				'hy' => 'ارمني',
 				'ia' => 'انټرلنګوا',
 				'id' => 'انډونېشيايي',
 				'ie' => 'آسا نا جبة',
 				'is' => 'أيسلېنډي',
 				'it' => 'ایټالوي',
 				'ja' => 'جاپانی',
 				'jv' => 'جاوايې',
 				'ka' => 'جورجيائي',
 				'km' => 'کمبوډيايې يا د کمبوډيا',
 				'kn' => 'کنأډه',
 				'ko' => 'کوريائي',
 				'ku' => 'کردي',
 				'ky' => 'کرګيز',
 				'la' => 'لاتیني',
 				'lo' => 'لويتين',
 				'lt' => 'ليتواني',
 				'lv' => 'لېټواني',
 				'mg' => 'ملغاسي',
 				'mk' => 'مقدوني',
 				'ml' => 'مالايالم',
 				'mn' => 'مغولي',
 				'mr' => 'مراټهي',
 				'ms' => 'ملایا',
 				'mt' => 'مالټايي',
 				'ne' => 'نېپالي',
 				'nl' => 'هالېنډي',
 				'nn' => 'ناروېئي (نائنورسک)',
 				'no' => 'ناروېئې',
 				'oc' => 'اوکسيټاني',
 				'or' => 'اوريا',
 				'pa' => 'پنجابي',
 				'pl' => 'پولنډي',
 				'ps' => 'پښتو',
 				'pt' => 'پورتګالي',
 				'pt_BR' => 'پرتگال (برازيل)',
 				'pt_PT' => 'پرتګالي (پرتګال)',
 				'ro' => 'روماني',
 				'ru' => 'روسي',
 				'sa' => 'سنسکریټ',
 				'sd' => 'سندهي',
 				'sh' => 'سرب-کروشيايي',
 				'si' => 'سينهالي',
 				'sk' => 'سلوواکي',
 				'sl' => 'سلوواني',
 				'so' => 'سومالي',
 				'sq' => 'الباني',
 				'sr' => 'سربيائي',
 				'st' => 'سيسوتو',
 				'su' => 'سوډاني',
 				'sv' => 'سویډنی',
 				'sw' => 'سواهېلي',
 				'ta' => 'تامل',
 				'te' => 'تېليګو',
 				'tg' => 'تاجک',
 				'th' => 'تايلېنډي',
 				'ti' => 'تيګريني',
 				'tk' => 'ترکمني',
 				'tlh' => 'کلينګاني',
 				'tr' => 'ترکي',
 				'tt' => 'تاتار',
 				'tw' => 'توی',
 				'ug' => 'اويگور',
 				'uk' => 'اوکرانايي',
 				'ur' => 'اردو',
 				'uz' => 'ازبکي',
 				'vi' => 'وېتنامي',
 				'xh' => 'خوسا',
 				'yi' => 'يديش',
 				'zh' => 'چیني',
 				'zu' => 'زولو',

			);
			if (@_) {
				return $languages{$_[0]};
			}
			return \%languages;
		}
	},
);

has 'display_name_script' => (
	is			=> 'ro',
	isa			=> 'CodeRef',
	init_arg	=> undef,
	default		=> sub {
		sub {
			my %scripts = (
			'Arab' => 'عربي',

			);
			if ( @_ ) {
				return $scripts{$_[0]};
			}
			return \%scripts;
		}
	}
);

has 'display_name_territory' => (
	is			=> 'ro',
	isa			=> 'HashRef[Str]',
	init_arg	=> undef,
	default		=> sub { 
		{
			'AF' => 'افغانستان',
 			'AL' => 'البانیه',
 			'AO' => 'انګولا',
 			'AQ' => 'انتارکتیکا',
 			'AT' => 'اتریش',
 			'BD' => 'بنګله‌دیش',
 			'BG' => 'بلغاریه',
 			'CA' => 'کاناډا',
 			'CH' => 'سویس',
 			'CN' => 'چین',
 			'CO' => 'کولمبیا',
 			'CU' => 'کیوبا',
 			'DE' => 'المان',
 			'DK' => 'ډنمارک',
 			'DZ' => 'الجزایر',
 			'EG' => 'مصر',
 			'ES' => 'هسپانیه',
 			'ET' => 'حبشه',
 			'FI' => 'فنلینډ',
 			'FR' => 'فرانسه',
 			'GB' => 'برتانیه',
 			'GH' => 'ګانا',
 			'GN' => 'ګیانا',
 			'GR' => 'یونان',
 			'GT' => 'ګواتیمالا',
 			'HN' => 'هانډوراس',
 			'HU' => 'مجارستان',
 			'ID' => 'اندونیزیا',
 			'IN' => 'هند',
 			'IQ' => 'عراق',
 			'IS' => 'آیسلینډ',
 			'IT' => 'ایټالیه',
 			'JM' => 'جمیکا',
 			'JP' => 'جاپان',
 			'KH' => 'کمبودیا',
 			'KW' => 'کویټ',
 			'LA' => 'لاوس',
 			'LB' => 'لبنان',
 			'LR' => 'لایبریا',
 			'LY' => 'لیبیا',
 			'MA' => 'مراکش',
 			'MN' => 'مغولستان',
 			'MY' => 'مالیزیا',
 			'NG' => 'نایجیریا',
 			'NI' => 'نکاراګوا',
 			'NL' => 'هالېنډ',
 			'NO' => 'ناروې',
 			'NP' => 'نیپال',
 			'NZ' => 'نیوزیلنډ',
 			'PK' => 'پاکستان',
 			'PL' => 'پولنډ',
 			'PS' => 'فلسطین',
 			'PT' => 'پورتګال',
 			'RU' => 'روسیه',
 			'RW' => 'روندا',
 			'SA' => 'سعودی عربستان',
 			'SE' => 'سویډن',
 			'SV' => 'سالوېډور',
 			'SY' => 'سوریه',
 			'TJ' => 'تاجکستان',
 			'TZ' => 'تنزانیا',
 			'UY' => 'یوروګوای',
 			'YE' => 'یمن',

		}
	},
);

has 'text_orientation' => (
	is			=> 'ro',
	isa			=> 'HashRef[Str]',
	init_arg	=> undef,
	default		=> sub { return {
			lines => '',
			characters => 'right-to-left',
		}}
);

has 'characters' => (
	is			=> 'ro',
	isa			=> 'HashRef',
	init_arg	=> undef,
	default		=> sub {
		no warnings 'experimental::regex_sets';
		return {
			auxiliary => qr{(?^u:[‌ ‍ ‎‏])},
			index => ['آ', 'ا', 'ء', 'ب', 'پ', 'ت', 'ټ', 'ث', 'ج', 'ځ', 'چ', 'څ', 'ح', 'خ', 'د', 'ډ', 'ذ', 'ر', 'ړ', 'ز', 'ژ', 'ږ', 'س', 'ش', 'ښ', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ک', 'ګ', 'ل', 'م', 'ن', 'ڼ', 'ه', 'و', 'ی'],
			main => qr{(?^u:[َ ِ ُ ً ٍ ٌ ّ ْ ٔ ٰ آ ا أ ء ب پ ت ټ ث ج ځ چ څ ح خ د ډ ذ ر ړ ز ژ ږ س ش ښ ص ض ط ظ ع غ ف ق ک ګ ل م ن ڼ ه ة و ؤ ی ي ې ۍ ئ])},
		};
	},
);

